namespace MobileInsurance  

module Data =
    let zones =
        [ { Name = "Зона1"
            Coefficient = 4.8
            Cities = [ "Киев" ] }
          { Name = "Зона2"
            Coefficient = 2.5
            Cities = [ "Босприсполь"; "Боярка"; "Бровары"; "Васильков"; "Вышгород"; "Вешневое"; "Ирпень" ] }
          { Name = "Зона3"
            Coefficient = 3.4
            Cities = [ "Одесса"; "Харьков" ] }
          { Name = "Зона4"
            Coefficient = 2.8
            Cities = [ "Днепропетровск"; "Донецк"; "Запорожье"; "Кривой Рог"; "Львов" ] }

          { Name = "Зона5"
            Coefficient = 2.2
            Cities =
                [ "Алчевськ"; "Бердянськ"; "Біла Церква"; "Вінниця"; "Дніпродзержинськ"; "Горлівка"; "Євпаторія";
                  "Житомир"; "Івано-Франківськ"; "Кам’янець-Подільский"; "Керч"; "Кіровоград"; "Краматорськ";
                  "Кременчук"; "Лисичанськ"; "Луганськ"; "Луцьк"; "Макіївка"; "Маріуполь"; "Мелітополь"; "Миколаїв";
                  "Нікополь"; "Павлоград"; "Полтава"; "Рівне"; "Севастополь"; "Сєверодонецьк"; "Сімферополь";
                  "Слов’янськ"; "Суми"; "Тернопіль"; "Ужгород"; "Херсон"; "Хмельницький"; "Черкаси"; "Чернівці";
                  "Чернігів" ] }
          { Name = "Зона6"
            Coefficient = 1.5
            Cities = [ "Другие населенные пункты Украины" ] }
          { Name = "Зона7"
            Coefficient = 3.
            Cities = [ "За пределами Украины" ] } ]

    let cars =
        [ { GroupName = "Мотоцикли та моторолери"
            Type =
                [ { Coefficient = 0.38
                    Name = "до 300 кубічних сантиметрів" }
                  { Coefficient = 0.68
                    Name = "від 300 кубічних сантиметрів" } ] }
          { GroupName = "Легковий автомобіль"
            Type =
                [ { Coefficient = 1.
                    Name = "до 1600 кубічних сантиметрів" }
                  { Coefficient = 1.18
                    Name = "2001 - 3000 кубічних сантиметрів" }
                  { Coefficient = 1.82
                    Name = "більше 3000 кубічних сантиметрів" } ] }
          { GroupName = "Вантажні автомобілі"
            Type =
                [ { Coefficient = 2.
                    Name = "до 2 тонн (включно)" }
                  { Coefficient = 2.18
                    Name = "понад 2 тонни" } ] }
          { GroupName = "Автобуси"
            Type =
                [ { Coefficient = 2.55
                    Name = "до 20 чоловік (включно)" }
                  { Coefficient = 3.
                    Name = "понад 20 чоловік" } ] }
          { GroupName = "Причепи"
            Type =
                [ { Coefficient = 0.5
                    Name = "до вантажних автомобілів" }
                  { Coefficient = 0.34
                    Name = "до легкових автомобілівв" } ] } ]

    let (scopeuse : ViewScopeUse array) =
        [| { Name = "Личный автомобиль"
             Coefficient = 1. }
           { Name = "Использую как такси"
             Coefficient = 1.4 }
           { Name = "Работаю водителем"
             Coefficient = 1.3 }
           { Name = "Работаю в такси"
             Coefficient = 1.5 } |]